Revit 2027 API
RevitEventArgs Properties
The RevitEventArgs type exposes the following members.
Properties
Name | Description
Cancel |  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
Top
See Also
Reference
RevitEventArgs Class
Autodesk.Revit.DB.Events Namespace